################### 基础阶段
#--- 基础知识框架
Python基础、基本数据类型、数据类型转换、流程控制和循环结构、
函数、字符串、列表和元组、字典、集合、文件操作、高阶函数和匿名函数、
模块、递归函数、面向对象编程、封装、继承、多态、魔术方法、异常处理、
数据结构与初级算法等。

#--- 必备的核心能力
1、首先对Python的数据类型有一个深刻的了解
2、对Python编程的语法能够熟练的掌握
3、具备熟练编写函数式编程的能力
4、具备基于面向对象思想的编程能力
5、具备一定的数据结构与算法的能力
6、掌握Python所有的核心知识，并且具备基本的开发思维和开发的能力

#--- 应用领域
熟练学习和掌握之后，可晋级Web全栈开发、爬虫工程师、数据分析、人工智能等

本阶段内容是Python的入门以及核心内容，
对于日后任何领域的开发都有非常重要的意义

################### 高级阶段
# --- 掌握的知识
HTML、CSS、JavaScript、正则表达、jQuery、Ajax、Vue、数据库、
Mysql、Mongodb、Redis

# --- 核心能力
1.具备静态网页的开发能力
2.利用BootStrap快速搭建及兼容PC端又兼容移动端的静态网页
3.掌握数据库的基本使用，数据的增删改查和MySQL数据的优化方案

# --- 应用领域
熟练学习和掌握之后，可晋级Web全栈开发、爬虫工程师、数据分析、人工智能
熟练学习掌握后,可满足后期Web、爬虫、数据分析的学习和工作的需求

# ################## 实战阶段一
# web开发 和 数据爬取
# --- 掌握知识
Django框架、Flask框架、网络编程、多线程、爬虫原理和数据爬取、
非结构化数据与结构化数据提取、基于网站动态交互处理机制下的数据爬取、
通过Scrapy框架实现高并发数据爬取、分布式爬虫源码解析和部署
liunx入门


# --- 核心能力
1.掌握MVC和MTV设计模式
2.掌握Django中请求处理方式FBV和CBV
3.掌握ORM关系映射
4.掌握Django中间件的使用
5.Web框架模板引擎的使用
6.掌握数据爬取技术
7.能够分析出网站的各种规律
8.熟悉常见的反爬手段并能够处理这些网站
9.掌握多线程编程和网络编程
10.熟练掌握Scrapy框架的使用
11.了解爬虫的分布式机制

# 主要应用领域
web网站和 网络爬虫

################### 实战阶段二
数据分析 和 人工智能

# --- 掌握技术
环境和工具、Pandas数据预处理和数据分析、非结构化数据分析、Matplotlib、
数据可视化、Numpy数值计算、探索性数据分析、线性代数、概率论与数理统计、
非线性回归算法、线性判别算法、Kmean聚类算法与主成分分析算法，典型关联分析，
决策树，神经网络、深度学习库：TensorFlow等

# --- 核心掌握能力
1.深刻理解LDA和QDA理论以及其Python算法实现以及它们的多种应用实例
2.K-means核心算法以及算法实现
3.多元统计学以及CCA算法推导
4.PCA降维算法以及算法实现
5.决策树分类与预测算法
6.BP神经网络算法

# --- 应用场景
传统或互联网等行业产品、市场、运营等相关岗位的数据处理和分析等相关工作，
图像处理，人脸识别预测，图像处理，分类，图像识别等

# --- 市场价值
掌握相关技能后，可独立完成市面常见数据相关工作，胜任数据分析师、商业分析、
市场分析、数据产品等岗位。薪资范围6000-12000左右

往后就可以发展机器开发 自动化 深度学习等等 高级应用